{
  "items": [
    {
      "id": "mX_q01",
      "question_text": "¿Cuál es la definición clásica de un problema de investigación según Fred Kerlinger?",
      "options": [
        "Un enunciado descriptivo que caracteriza un fenómeno.",
        "Un enunciado interrogativo que pregunta sobre la relación entre dos o más variables.",
        "Una dificultad observada en un contexto real que requiere una solución práctica.",
        "Una afirmación que debe ser verificable como absolutamente falsa o verdadera."
      ],
      "correct_option_index": 1,
      "difficulty": "facil",
      "feedback": {
        "correct": "¡Directo a Kerlinger! ✅ Es la definición de libro. La ciencia no solo pregunta '¿qué es esto?', sino '¿qué le pasa a X *cuando* muevo Y?'. ¡Pura relación!",
        "incorrect": "Nop. Esas otras son descripciones o problemas prácticos. La clave de Kerlinger es la **relación entre variables** en forma de pregunta. 🧐"
      }
    },
    {
      "id": "mX_q02",
      "question_text": "En esencia, la investigación científica es una actividad de naturaleza cognoscitiva cuyo propósito es obtener nuevos conocimientos para cubrir una laguna en nuestro saber.",
      "options": [
        "Verdadero",
        "Falso"
      ],
      "correct_option_index": 0,
      "difficulty": "facil",
      "feedback": {
        "correct": "¡Verdadero! 🧠 La investigación es, en esencia, el deporte de los curiosos. Vemos un 'hueco' en lo que sabemos y nuestra misión es rellenarlo con conocimiento.",
        "incorrect": "¡Cuidado! Es verdadero. Es la definición más pura. No investigamos (científicamente) para opinar o confirmar creencias, sino para *conocer* y tapar esa laguna."
      }
    },
    {
      "id": "mX_q03",
      "question_text": "Según F. J. McGuigan, la manifestación de la falta de información suficiente ocurre por lo menos de tres maneras. ¿Cuál de las siguientes es una de ellas?",
      "options": [
        "La imposibilidad de definir operacionalmente una variable.",
        "Cuando existe un 'hecho' como una pequeña porción de información que no tenemos explicación.",
        "Cuando la pregunta se enfoca meramente en una enumeración de datos.",
        "La dificultad para aplicar modelos PICO."
      ],
      "correct_option_index": 1,
      "difficulty": "intermedio",
      "feedback": {
        "correct": "¡Esa es! 💡 A veces el problema no es que no haya datos, sino que hay un 'hecho' huérfano (ej: '¿por qué la gente hace X?') y no tenemos ni idea de por qué.",
        "incorrect": "Mmm, esas no son las que menciona McGuigan. Las 3 claves son: 1) una laguna, 2) resultados contradictorios, o 3) un hecho sin explicación. ¡Esta era la 3!"
      }
    },
    {
      "id": "mX_q04",
      "question_text": "Un problema práctico, o situación problémica, es una dificultad observada en un contexto real que requiere una solución, mientras que un problema científico es una cuestión de naturaleza cognoscitiva.",
      "options": [
        "Verdadero",
        "Falso"
      ],
      "correct_option_index": 0,
      "difficulty": "facil",
      "feedback": {
        "correct": "¡Verdadero! Diferencia clave. Problema práctico: 'El puente se cae' (necesita solución YA). Problema científico: '¿*Por qué* se cae el puente?' (necesita conocimiento). 🌉",
        "incorrect": "¡Ojo! Es verdadero. Uno es de 'hacer' (práctico), el otro es de 'saber' (científico). No los confundas, aunque a menudo el práctico inspira al científico."
      }
    },
    {
      "id": "mX_q05",
      "question_text": "¿Qué manifestación de un problema científico ocurre cuando no concuerdan los resultados de varias investigaciones sobre el mismo tema?",
      "options": [
        "Una laguna en nuestro conocimiento.",
        "Resultados contradictorios.",
        "Un hecho sin explicación.",
        "Un problema de circularidad viciosa."
      ],
      "correct_option_index": 1,
      "difficulty": "facil",
      "feedback": {
        "correct": "¡Exacto! 💥 Cuando el Estudio A dice 'blanco' y el Estudio B dice 'negro' sobre lo mismo... ¡felicidades, tienes un problema de investigación! Hay que averiguar quién tiene razón (o si ambos están mal).",
        "incorrect": "Nop. Una 'laguna' es un vacío. Un 'hecho sin explicar' es un misterio. Pero cuando dos investigaciones chocan, eso es una **contradicción** directa."
      }
    },
    {
      "id": "mX_q06",
      "question_text": "El criterio de Comprobabilidad Empírica (o ser 'soluble') exige que el problema permita realizar observaciones o mediciones en el mundo real que aporten evidencia para responder la pregunta.",
      "options": [
        "Verdadero",
        "Falso"
      ],
      "correct_option_index": 0,
      "difficulty": "intermedio",
      "feedback": {
        "correct": "¡Verdadero! Es la regla de oro. 🌎 Si tu pregunta no se puede responder midiendo, contando u observando algo en el *mundo real*, no es ciencia. Es filosofía o fe.",
        "incorrect": "¡Alerta! Es verdadero. 'Comprobable empíricamente' = 'se puede poner a prueba'. Si no puedes diseñar un experimento u observación, tu problema es 'insoluble' para la ciencia."
      }
    },
    {
      "id": "mX_q07",
      "question_text": "Según los criterios fundamentales, la ciencia no se ocupa de estudiar variables aisladas, sino de entender cómo estas:",
      "options": [
        "Son expresadas mediante juicios de valor.",
        "Se manifiestan de forma contemplativa.",
        "Interactúan, se influencian o se asocian entre sí.",
        "Se definen únicamente por sus conceptos constitutivos."
      ],
      "correct_option_index": 2,
      "difficulty": "intermedio",
      "feedback": {
        "correct": "¡Ahí está! La ciencia es el estudio de las relaciones. 📈 No nos importa solo 'qué es la ansiedad', sino 'cómo la ansiedad *afecta* a la memoria'. ¡Buscamos la interacción!",
        "incorrect": "'Variables aisladas' es como coleccionar estampillas. La ciencia es entender *por qué* una estampilla está pegada a la otra (o cómo se relacionan)."
      }
    },
    {
      "id": "mX_q08",
      "question_text": "Una pregunta de valor, como '¿Es el capitalismo bueno?', no puede ser un problema científico porque:",
      "options": [
        "Requiere una definición operacional.",
        "Busca optimizar un proceso técnico.",
        "Es un juicio de valor que no puede responderse mediante observación empírica.",
        "Es potencialmente comprobable, pero no al presente."
      ],
      "correct_option_index": 2,
      "difficulty": "intermedio",
      "feedback": {
        "correct": "¡Preciso! 🧐 La ciencia no puede medir 'bondad'. Es un juicio de valor moral o filosófico. Podemos medir 'efectos del capitalismo en la pobreza', pero no si es 'bueno' o 'malo'.",
        "incorrect": "Nop. El problema no es la definición, es la *naturaleza* de la pregunta. 'Bueno' o 'malo' no se puede meter en un tubo de ensayo. No es empírico."
      }
    },
    {
      "id": "mX_q09",
      "question_text": "El requisito de 'Claridad y Sin Ambigüedad' en la formulación del problema tiene como objetivo evitar:",
      "options": [
        "El desconcierto y la incapacidad de diseñar un estudio efectivo.",
        "La replicación de estudios previos.",
        "La aplicación del criterio FINER.",
        "La necesidad de definir operacionalmente variables."
      ],
      "correct_option_index": 0,
      "difficulty": "facil",
      "feedback": {
        "correct": "¡Evidente, pero crucial! ✅ Si tu pregunta es confusa ('¿Es la vida... algo?'), nadie (ni tú mismo) sabrá qué datos recoger. Una pregunta clara es el 50% de la respuesta.",
        "incorrect": "Al contrario. Una pregunta clara es lo que *permite* replicar, aplicar FINER y definir variables. Sin claridad, no hay nada, solo niebla. 🌫️"
      }
    },
    {
      "id": "mX_q10",
      "question_text": "La ciencia es incapaz de contestar preguntas que por su forma o substancia no pueden someterse a prueba o ser comprobadas, o no implican relaciones entre variables.",
      "options": [
        "Verdadero",
        "Falso"
      ],
      "correct_option_index": 0,
      "difficulty": "facil",
      "feedback": {
        "correct": "¡Verdadero! La ciencia tiene límites. ✋ Si la pregunta es metafísica ('¿cuál es el sentido de la vida?') o no testeable... la ciencia humildemente dice 'eso no es lo mío'.",
        "incorrect": "Es verdadero. Es una autolimitación importante. Si no se puede poner a prueba, si no hay variables relacionándose... no es un problema científico."
      }
    },
    {
      "id": "mX_q11",
      "question_text": "La **definición operacional** se distingue porque esencialmente especifica:",
      "options": [
        "Las consecuencias filosóficas de la hipótesis.",
        "Las actividades u 'operaciones' necesarias para registrar y medir un fenómeno.",
        "La delimitación del aporte real del estudio.",
        "El consenso teórico entre los investigadores."
      ],
      "correct_option_index": 1,
      "difficulty": "dificil",
      "feedback": {
        "correct": "¡Definición de oro! 💡 'Operacional' = 'con qué operaciones mido esto'. No es la idea ('ansiedad'), es la acción ('número de palpitaciones por minuto' o 'puntos en el test X').",
        "incorrect": "No es filosófico ni un consenso. Es la 'receta' exacta 📜. ¿Cómo conviertes tu concepto abstracto (inteligencia) en un número (puntos en un test)? Eso es operacionalizar."
      }
    },
    {
      "id": "mX_q12",
      "question_text": "Uno de los errores frecuentes en la formulación de problemas es la 'Contaminación con el método', que consiste en incluir parte de la metodología en el propio enunciado del problema.",
      "options": [
        "Verdadero",
        "Falso"
      ],
      "correct_option_index": 0,
      "difficulty": "intermedio",
      "feedback": {
        "correct": "¡Verdadero! Es un error clásico. 😅 El *problema* es '¿Qué relación hay entre X e Y?'. El *método* es '...aplicando un cuestionario a 50 personas'. ¡No los mezcles en la pregunta!",
        "incorrect": "¡Cuidado, es verdadero! Es un error súper común. La pregunta debe ser pura. El 'cómo lo harás' (el método) viene después, en el diseño."
      }
    },
    {
      "id": "mX_q13",
      "question_text": "Cuando se utiliza un razonamiento sofístico de 'circularidad viciosa', el problema es considerado irresoluble porque:",
      "options": [
        "La hipótesis se formula como una afirmación declaratoria.",
        "La pregunta se basa en la respuesta, sin recurrir a información externa que la sustente.",
        "Se utilizan variables solamente con dos valores (dicotómicas).",
        "El problema es potencialmente comprobable, pero no al presente."
      ],
      "correct_option_index": 1,
      "difficulty": "dificil",
      "feedback": {
        "correct": "¡Exacto! 🔄 Es una trampa lógica. '¿Por qué la gente fuma? Porque es adicta'. '¿Y cómo sabes que es adicta? Porque fuma'. No sales de ahí. No hay dato externo.",
        "incorrect": "Nop. Es un problema de lógica, no de formato. La 'circularidad viciosa' es un 'loop' donde la pregunta ya asume la respuesta. Es irresoluble."
      }
    },
    {
      "id": "mX_q14",
      "question_text": "Según la Teoría Probabilística de Comprobabilidad, ninguna proposición empírica puede jamás ser absolutamente falsa o absolutamente verdadera.",
      "options": [
        "Verdadero",
        "Falso"
      ],
      "correct_option_index": 0,
      "difficulty": "dificil",
      "feedback": {
        "correct": "¡Verdadero! 🤯 Un concepto profundo. En ciencia empírica, nunca 'probamos' algo al 100%. Solo acumulamos evidencia y decimos 'estamos *muy* seguros'. Siempre hay probabilidad de error.",
        "incorrect": "Es verdadero. Es una lección de humildad científica. No buscamos 'La Verdad' absoluta, buscamos la 'mejor explicación probable' basada en los datos."
      }
    },
    {
      "id": "mX_q15",
      "question_text": "Cuando un problema es formulado como un dominio de interés vago, como 'Estudiar el desempeño de la enfermera', sin establecer relaciones o ser preciso, se incurre en el error de:",
      "options": [
        "Circularidad viciosa.",
        "Falta de fundamento teórico.",
        "Ambigüedad y falta de concreción.",
        "Definiciones operacionales deficientes."
      ],
      "correct_option_index": 2,
      "difficulty": "intermedio",
      "feedback": {
        "correct": "¡Totalmente! 'Estudiar el desempeño' no es una pregunta, es un tema de tesis. 😴 ¿Qué *del* desempeño? ¿Relacionado con *qué*? ¡Falta concreción!",
        "incorrect": "No es circular. Es simplemente... vago. Es como decir 'Voy a investigar sobre los carros'. Ajá, ¿pero *qué* de los carros? 🚗💨 Faltan las variables y la relación."
      }
    },
    {
      "id": "mX_q16",
      "question_text": "El modelo PICO es el más conocido para estructurar preguntas en estudios cuantitativos de intervención. ¿Qué representa la 'O'?",
      "options": [
        "Población.",
        "Operación.",
        "Outcome/Resultado.",
        "Observación."
      ],
      "correct_option_index": 2,
      "difficulty": "facil",
      "feedback": {
        "correct": "¡Correcto! La 'O' es el **Outcome**. Es el *resultado* que te interesa medir. ¿Qué esperas que cambie? ¿Mortalidad? ¿Dolor? ¿Conocimiento?",
        "incorrect": "P (Población), I (Intervención), C (Comparación), O (**Outcome**). ¡El resultado es la clave! 🎯"
      }
    },
    {
      "id": "mX_q17",
      "question_text": "El modelo PECO es una adaptación del PICO y se usa para diseños observacionales, sustituyendo la Intervención por la Exposición a un factor.",
      "options": [
        "Verdadero",
        "Falso"
      ],
      "correct_option_index": 0,
      "difficulty": "intermedio",
      "feedback": {
        "correct": "¡Verdadero! ☣️ Cuando no puedes *intervenir* (ej. no puedes obligar a la gente a fumar), usas PECO. La 'I' de Intervención se cambia por la 'E' de **Exposición**.",
        "incorrect": "Es verdadero. Es la adaptación perfecta del PICO para estudios observacionales (como los epidemiológicos), donde solo puedes 'observar' si la gente estuvo expuesta."
      }
    },
    {
      "id": "mX_q18",
      "question_text": "El criterio del filtro de evaluación FINER que considera si se cuenta con el número adecuado de sujetos, la experticia técnica y los recursos económicos necesarios es:",
      "options": [
        "Factible (F).",
        "Novedoso (N).",
        "Ético (E).",
        "Relevante (R)."
      ],
      "correct_option_index": 0,
      "difficulty": "facil",
      "feedback": {
        "correct": "¡Exacto! **Factible** = ¿Se *puede* hacer? 💰🧑‍🔬⏰ ¿Tengo el dinero, la gente, el tiempo y el *know-how*? Si no, es una gran idea... pero infactible.",
        "incorrect": "Esas otras son importantes, pero la 'logística' (dinero, tiempo, sujetos, experticia) es 100% la 'F' de Factible."
      }
    },
    {
      "id": "mX_q19",
      "question_text": "El modelo SPIDER está diseñado para reflejar la naturaleza exploratoria y se utiliza principalmente en la investigación cualitativa o de métodos mixtos.",
      "options": [
        "Verdadero",
        "Falso"
      ],
      "correct_option_index": 0,
      "difficulty": "intermedio",
      "feedback": {
        "correct": "¡Verdadero! 🕷️ SPIDER es el PICO del mundo cualitativo. Está hecho para explorar experiencias y percepciones, no para medir intervenciones numéricas.",
        "incorrect": "Es verdadero. Si ves SPIDER, piensa en 'cualitativo' o 'mixto'. Es la herramienta para preguntas exploratorias sobre experiencias y percepciones."
      }
    },
    {
      "id": "mX_q20",
      "question_text": "Un problema que se mantiene irresoluble porque, aunque sus términos se definan operacionalmente, los científicos no saben especificar cómo obtener los datos necesarios, ilustra la razón de:",
      "options": [
        "Definiciones inadecuadas.",
        "Imposibilidad de obtener datos relevantes.",
        "Circularidad viciosa.",
        "Resultados contradictorios."
      ],
      "correct_option_index": 1,
      "difficulty": "dificil",
      "feedback": {
        "correct": "¡Así es! 🛸 A veces la pregunta es genial (ej. '¿Hay vida inteligente en la galaxia X?'), pero no tenemos la *tecnología* (los datos) para responderla. Es irresoluble... por ahora.",
        "incorrect": "No es circularidad ni mala definición. La pregunta es clara, pero es 'imposible al presente'. No tenemos la nave espacial (los datos) para ir a ver."
      }
    },
    {
      "id": "mX_q21",
      "question_text": "La 'F' de Factible en el criterio FINER solo evalúa si se cuenta con los recursos económicos y el tiempo, sin considerar la experticia técnica del investigador.",
      "options": [
        "Verdadero",
        "Falso"
      ],
      "correct_option_index": 1,
      "difficulty": "facil",
      "feedback": {
        "correct": "¡Falso! 🛑 La experticia técnica es CRUCIAL para la factibilidad. Puedes tener todo el dinero del mundo, pero si no sabes cómo hacer la cirugía o el análisis estadístico... el estudio es infactible.",
        "incorrect": "¡Alerta! Es falso. La 'F' de Factible incluye *todo* lo logístico: tiempo, dinero, sujetos *y* la experticia técnica del equipo. ¿Puedes hacerlo?"
      }
    },
    {
      "id": "mX_q22",
      "question_text": "El error de 'Formulación acrítica o meramente contemplativa' viola el criterio de Kerlinger porque no busca una relación entre variables, limitándose a una enumeración de datos.",
      "options": [
        "Verdadero",
        "Falso"
      ],
      "correct_option_index": 0,
      "difficulty": "intermedio",
      "feedback": {
        "correct": "¡Verdadero! 🥱 Una pregunta 'contemplativa' (ej. '¿Cuánta gente usa el metro?') es solo pedir un dato. No relaciona variables (criterio de Kerlinger). La ciencia busca *relaciones*.",
        "incorrect": "Es verdadero. Es un error porque es solo 'descriptivo' básico. La ciencia de verdad empieza cuando preguntas '¿El *uso del metro* se relaciona con el *nivel de estrés*?'."
      }
    },
    {
      "id": "mX_q23",
      "question_text": "Se considera que un problema es 'posible al presente' si la solución de la tarea es factible con los métodos de investigación de los que se dispone inmediatamente.",
      "options": [
        "Verdadero",
        "Falso"
      ],
      "correct_option_index": 0,
      "difficulty": "intermedio",
      "feedback": {
        "correct": "¡Verdadero! Es una definición práctica. 'Posible al presente' = 'Tenemos las herramientas *hoy* para hacerlo'. 🛠️ Lo de viajar a Marte era 'insoluble' en 1950, pero 'posible al presente' hoy.",
        "incorrect": "¡Cuidado, es verdadero! Es la definición literal. Si los métodos y herramientas existen *ahora*, es 'posible al presente'."
      }
    },
    {
      "id": "mX_q24",
      "question_text": "En el modelo SPIDER, la 'E' (Evaluation/Evaluación) se refiere a:",
      "options": [
        "El diseño de la investigación (cualitativo o mixto).",
        "La Exposición a un factor de riesgo.",
        "Los resultados subjetivos, como puntos de vista, opiniones o experiencias.",
        "El número adecuado de sujetos."
      ],
      "correct_option_index": 2,
      "difficulty": "dificil",
      "feedback": {
        "correct": "¡Difícil, pero la tienes! 🧠 En SPIDER, la 'E' no es un 'Outcome' numérico, es la **Evaluación** de los resultados subjetivos: las experiencias, opiniones, sentimientos...",
        "incorrect": "Nop. 'Exposición' es de PECO. En SPIDER, la 'E' (Evaluation) es el corazón cualitativo: ¿qué *experiencias* o *puntos de vista* estamos buscando? 🗣️"
      }
    },
    {
      "id": "mX_q25",
      "question_text": "El criterio de 'Novedoso' (N) en FINER obliga al investigador a asegurarse de que su pregunta no sea una replicación inútil o una especulación teóricamente infundamentada.",
      "options": [
        "Verdadero",
        "Falso"
      ],
      "correct_option_index": 0,
      "difficulty": "intermedio",
      "feedback": {
        "correct": "¡Verdadero! 💡 La 'N' de Novedoso no es solo 'ser original'. Es evitar replicar algo inútilmente. La ciencia avanza, no da vueltas en el mismo sitio.",
        "incorrect": "Es verdadero. La ciencia es construir sobre lo que ya existe. Si tu pregunta ya está mega-respondida, o es una idea loca sin fundamento... no pasa el filtro 'N'."
      }
    }
  ]
}